README.org
#+TITLE: My Literate Emacs Config
#+STARTUP: noindent

* Table of Contents :TOC_5:
  - [[#about-this-configuration][About This Configuration]]
    - [[#applying-changes][Applying Changes]]
  - [[#package-manager][Package Manager]]
    - [[#package-repositories][Package Repositories]]
      - [[#initialize-package-repositories][Initialize package repositories]]
    - [[#use-package][Use Package]]
      - [[#install-use-package-if-not-installed][Install use-package if not installed]]
      - [[#always-install-packages-if-not-installed][Always install packages if not installed]]
      - [[#always-compile-packages-and-use-the-newest-version-available][Always compile packages, and use the newest version available.]]
  - [[#better-defaults][Better Defaults]]
    - [[#early-initel][early-init.el]]
    - [[#disable][Disable]]
    - [[#enable][Enable]]
    - [[#other][Other]]
  - [[#custom-functions][Custom Functions]]
    - [[#find-config][find-config]]
    - [[#disable-all-themes][disable-all-themes]]
    - [[#company-backend-with-yas][company-backend-with-yas]]
    - [[#company-smart-snippets][company-smart-snippets]]
    - [[#company-enable-snippets][company-enable-snippets]]
    - [[#activate-pyvenv][activate-pyvenv]]
    - [[#split-window-and-switch][split-window-and-switch]]
    - [[#backward-kill-word-or-region][backward-kill-word-or-region]]
    - [[#helm-do-ag-project-root-or-current-dir][helm-do-ag-project-root-or-current-dir]]
    - [[#go-scratch][go-scratch]]
    - [[#go-home][go-home]]
    - [[#go-messages][go-messages]]
    - [[#org-imenu][org-imenu]]
    - [[#darken-background][darken-background]]
    - [[#indent-buffer][indent-buffer]]
    - [[#dired-mouse-action][dired-mouse-action]]
    - [[#increase-font-size][increase-font-size]]
    - [[#decrease-font-size][decrease-font-size]]
    - [[#reset-font-size][reset-font-size]]
  - [[#theme][Theme]]
    - [[#disable-all-themes-before-loading-a-theme][Disable all themes before loading a theme]]
    - [[#i-use-doom-spacegrey][I use doom-spacegrey]]
    - [[#a-light-emacs-theme-thats-well-suited-for-org-mode][A light emacs theme that's well suited for org-mode]]
  - [[#packages][Packages]]
    - [[#org][Org]]
    - [[#helm][Helm]]
      - [[#helm-1][Helm]]
      - [[#helm-projectile][Helm Projectile]]
      - [[#helm-ag][Helm Ag]]
      - [[#helm-xref][Helm Xref]]
      - [[#helm-swoop][Helm Swoop]]
      - [[#helm-descbinds][Helm Descbinds]]
    - [[#shackle][Shackle]]
    - [[#company][Company]]
      - [[#company-1][Company]]
      - [[#company-box][Company Box]]
      - [[#company-statistics][Company Statistics]]
    - [[#projectile][Projectile]]
    - [[#lsp-mode][LSP Mode]]
    - [[#eglot][Eglot]]
    - [[#magit][Magit]]
    - [[#expand-region][Expand Region]]
    - [[#doom-modeline][Doom Modeline]]
    - [[#multiple-cursors][Multiple Cursors]]
    - [[#which-key][Which Key]]
    - [[#hl-todo][hl-todo]]
    - [[#beacon][Beacon]]
    - [[#toc-org][toc-org]]
    - [[#vterm][vterm]]
    - [[#emacs-dashboard][Emacs Dashboard]]
    - [[#yasnippet][YASnippet]]
    - [[#yasnippet-snippets][YASnippet-snippets]]
    - [[#winum][Winum]]
    - [[#deadgrep][Deadgrep]]
    - [[#avy][Avy]]
    - [[#highlight-indent-guides][Highlight Indent Guides]]
    - [[#wrap-region][Wrap Region]]
    - [[#rainbow-delimiters][Rainbow Delimiters]]
    - [[#golden-ratio][Golden Ratio]]
    - [[#treemacs][Treemacs]]
      - [[#treemacs-1][Treemacs]]
      - [[#treemacs-projectile][Treemacs Projectile]]
    - [[#shell-pop][Shell Pop]]
    - [[#dired-subtree][Dired Subtree]]
    - [[#auto-highlight-symbol-mode][Auto Highlight Symbol Mode]]
    - [[#git-gutter][Git Gutter]]
    - [[#diff-hl][diff-hl]]
    - [[#ob-async][ob-async]]
    - [[#web-mode][Web Mode]]
      - [[#web-mode-1][Web Mode]]
      - [[#emmet-mode][Emmet Mode]]
        - [[#emmet-mode-1][Emmet Mode]]
        - [[#helm-emmet][Helm Emmet]]
      - [[#company-web][Company Web]]
      - [[#json-mode][Json Mode]]
      - [[#prettier][Prettier]]
    - [[#anzu][Anzu]]
    - [[#dired-icons][Dired icons]]
    - [[#stripe-buffer][Stripe Buffer]]
  - [[#programming-languages][Programming Languages]]
    - [[#emacs-lisp][Emacs Lisp]]
      - [[#elisp-slime-nav][Elisp Slime Nav]]
      - [[#aggressive-indent][Aggressive Indent]]
    - [[#python][Python]]
      - [[#python-1][Python]]
      - [[#import-magic][Import Magic]]
  - [[#keybindings][Keybindings]]
    - [[#spacemacs-better-defaults-layer][Spacemacs' "Better Defaults" layer]]
    - [[#global-key-bindings][Global Key Bindings]]
    - [[#spacemacs-like-menu-map][Spacemacs-like Menu Map]]
  - [[#fun][Fun]]
    - [[#selectric-mode][Selectric Mode]]
    - [[#turkish-mode][Turkish Mode]]
    - [[#fireplace][Fireplace]]
    - [[#pacmacs][Pacmacs]]
    - [[#2048][2048]]
  - [[#custom-faces][Custom Faces]]
  - [[#experimental][Experimental]]
    - [[#restclient][Restclient]]
    - [[#garbage-collect-threshold][Garbage Collect Threshold]]
    - [[#minimap][Minimap]]
    - [[#olivetti][Olivetti]]
  - [[#other-emacs-configurations][Other Emacs Configurations]]

* About This Configuration
** Applying Changes
   To decrease startup time, I use a hook to export code blocks from my
   literate config file every time on save. Yes it is bad to run the
   function below even with unrelated files every time but I could not
   find a better solution (I tried file local variables but it ask
   permission to eval local variables every time). Since condition
   checking executes in microseconds, it does not bother me.
   #+BEGIN_SRC emacs-lisp
  (defun tangle-config ()
    "Export code blocks from my literate config file."
    (when (equal (buffer-file-name) config-org)
      (org-babel-tangle-file config-org config-el)))

  (add-hook 'after-save-hook 'tangle-config)
   #+END_SRC

* Package Manager
** Package Repositories
*** Initialize package repositories
    #+BEGIN_SRC emacs-lisp
      (require 'package)
      (setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
                               ("melpa" . "https://melpa.org/packages/")
                               ("org" . "https://orgmode.org/elpa/")))
      (package-initialize)
    #+END_SRC

** Use Package
*** Install use-package if not installed
    #+BEGIN_SRC emacs-lisp
      (unless (package-installed-p 'use-package)
        (package-refresh-contents)
        (package-install 'use-package))
    #+END_SRC

*** Always install packages if not installed
    #+BEGIN_SRC emacs-lisp
  (require 'use-package-ensure)
  (setq use-package-always-ensure t
  ;;      use-package-always-defer t
  )
    #+END_SRC

*** Always compile packages, and use the newest version available.
    #+BEGIN_SRC emacs-lisp
  ;;(use-package auto-compile
  ;;  :config (auto-compile-on-load-mode))
  (setq load-prefer-newer t)
    #+END_SRC

* Better Defaults
** early-init.el
   #+begin_src emacs-lisp :tangle early-init.el
     (add-hook 'post-gc-hook
               '(lambda ()
                  (message "%s %s" "GC COLLECT" (format-time-string "%-I:%M"))))

     (setq gc-cons-threshold most-positive-fixnum
           gc-cons-percentage 1)

     (menu-bar-mode -1)
     (tool-bar-mode -1)
     (scroll-bar-mode -1)

     ;;(add-to-list 'default-frame-alist '(fullscreen . maximized))
     (add-to-list 'default-frame-alist '(undecorated . t))

     (setq window-divider-default-places t
           window-divider-default-bottom-width 1
           window-divider-default-right-width 1)
     (window-divider-mode)

     (defvar default-font-size 90)
     (set-face-attribute 'default nil :family "Source Code Pro" :height default-font-size)
   #+end_src

** Disable
   #+BEGIN_SRC emacs-lisp
  (blink-cursor-mode -1)
  (setq-default ring-bell-function 'ignore
                tab-bar-show nil
                inhibit-startup-message t
                initial-scratch-message nil
                create-lockfiles nil
                confirm-kill-processes nil)
   #+END_SRC

** Enable
   #+BEGIN_SRC emacs-lisp
     (delete-selection-mode)
     (show-paren-mode)
     (global-subword-mode)
     (global-hl-line-mode)
     (winner-mode)
     (save-place-mode)
     (column-number-mode)
     (global-page-break-lines-mode)
     (global-auto-revert-mode)
     (global-prettify-symbols-mode)
   #+END_SRC

** Other
   #+BEGIN_SRC emacs-lisp
     (setq-default
      custom-file "/dev/null" ;; i dont use `customize' interface
      save-place-file (concat user-emacs-directory ".places")
      backup-directory-alist `((".*" . ,(concat user-emacs-directory ".backups/")))
      ;;auto-save-file-name-transforms `((".*" ,(concat user-emacs-directory ".saves") t))
      recenter-positions '(middle 0.15 top 0.85 bottom) ; C-l positions
      truncate-lines t
      frame-resize-pixelwise t
      backup-by-copying t
      sentence-end-double-space nil
      require-final-newline t
      scroll-conservatively 10000 ; Smooth scrolling
      indent-tabs-mode nil
      show-trailing-whitespace t
      frame-title-format '("%b [%m]") ; file name and major mode
      recentf-exclude '("/\\.config/emacs/elpa/" "^/tmp/" "^/usr/" "/\\.config/emacs/.cache/" "/\\.config/emacs/bookmarks")
      recentf-max-saved-items 200
      dired-listing-switches "-lAhp --group-directories-first"
      completion-styles '(basic flex))

     (defalias 'yes-or-no-p 'y-or-n-p)

     (add-hook 'before-save-hook 'whitespace-cleanup)
     (add-hook 'prog-mode-hook 'display-line-numbers-mode)
     (add-hook 'prog-mode-hook 'electric-pair-mode)
     ;;(add-hook 'prog-mode-hook 'display-fill-column-indicator-mode)
     (add-hook 'prog-mode-hook (lambda () (setq prettify-symbols-alist
                                           '(("lambda" . ?λ)
                                             ("->" . ?→)
                                             ("=>" . ?⇒)
                                             ("!=" . ?≠)
                                             ("<=" . ?≤)
                                             (">=" . ?≥)))))
     (with-eval-after-load 'dired
       (add-hook 'dired-mode-hook 'dired-hide-details-mode)
       (add-hook 'dired-mode-hook (lambda () (setq mouse-1-click-follows-link nil)))
       (define-key dired-mode-map (kbd "-") 'dired-up-directory)
       (define-key dired-mode-map (kbd "O") 'browse-url-of-dired-file)
       (define-key dired-mode-map (kbd "<mouse-1>") 'fk/dired-mouse-action)
       (define-key dired-mode-map (kbd "<mouse-2>") 'dired-up-directory)
       (define-key dired-mode-map (kbd "<mouse-3>") '(lambda (event) (interactive "e")
                                                       (mouse-set-point event)
                                                       (dired-subtree-toggle))))
   #+END_SRC

* Custom Functions
** find-config
   #+begin_src emacs-lisp
  (defun fk/find-config ()
    "Open config file."
    (interactive)
    (find-file config-org))
   #+end_src

** disable-all-themes
   #+begin_src emacs-lisp
  (defun fk/disable-all-themes ()
    "Disable all active themes."
    (dolist (theme custom-enabled-themes)
      (disable-theme theme)))
   #+end_src

** company-backend-with-yas
   #+begin_src emacs-lisp
  (defun fk/company-backend-with-yas (backend)
    "Add ':with company-yasnippet' to the given company backend."
    (if (and (listp backend) (member 'company-yasnippet backend))
    backend
      (append (if (consp backend)
          backend
        (list backend))
          '(:with company-yasnippet))))
   #+end_src

** company-smart-snippets
   #+begin_src emacs-lisp
     ;; TODO: creates a bug in scratch buffer.
     (defun fk/company-smart-snippets (fn command &optional arg &rest _)
       "Do not show yasnippet candidates after dot."
       ;;Source:
       ;;https://www.reddit.com/r/emacs/comments/7dnbxl/how_to_temporally_filter_companymode_candidates/
       ;;I did not understand anything but it works.
       (unless (when (and (equal command 'prefix) (> (point) 0))
                 (let* ((prefix (company-grab-symbol))
                        (point-before-prefix (- (point) (length prefix) 1))
                        (char (buffer-substring-no-properties point-before-prefix (1+ point-before-prefix))))
                   (string= char ".")))
         (funcall fn command arg)))
   #+end_src

** company-enable-snippets
   #+begin_src emacs-lisp
  (defun fk/company-enable-snippets ()
    "Enable snippet suggestions in company by adding
    ':with company-yasnippet' to all company backends."
    (interactive)
    (setq company-backends
          (mapcar 'fk/company-backend-with-yas company-backends))
    (advice-add 'company-yasnippet :around 'fk/company-smart-snippets))
   #+end_src

** activate-pyvenv
   #+begin_src emacs-lisp
  (defun fk/activate-pyvenv ()
    "Activate python environment according to the `.venv' file."
    (interactive)
    (let* ((pdir (projectile-project-root)) (pfile (concat pdir ".venv")))
      (if (file-exists-p pfile)
      (pyvenv-workon (with-temp-buffer
           (insert-file-contents pfile)
           (nth 0 (split-string (buffer-string))))))))
   #+end_src

** split-window-and-switch
   #+begin_src emacs-lisp
  (defun fk/split-window-below-and-switch ()
    "Split the window horizontally, then switch to the new window."
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1))

  (defun fk/split-window-right-and-switch ()
    "Split the window vertically, then switch to the new window."
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))
   #+end_src

** backward-kill-word-or-region
   #+begin_src emacs-lisp
  ;; source: spacemacs' better default layer
  (defun fk/backward-kill-word-or-region ()
    "Calls `kill-region' when a region is active and
    `backward-kill-word' otherwise."
    (interactive)
    (if (region-active-p)
    (call-interactively 'kill-region)
      (backward-kill-word 1)))
   #+end_src

** helm-do-ag-project-root-or-current-dir
   #+begin_src emacs-lisp
  (defun fk/helm-do-ag-project-root-or-current-dir ()
    "If in a project call `helm-do-ag-project-root', else call
  `helm-do-ag' with current directory."
    (interactive)
    (if (projectile-project-p)
    (helm-do-ag-project-root)
      (helm-do-ag default-directory)))
   #+end_src

** go-scratch
   #+begin_src emacs-lisp
  (defun fk/scratch ()
    "Switch to scratch buffer."
    (interactive)
    (switch-to-buffer "*scratch*"))
   #+end_src

** go-home
   #+begin_src emacs-lisp
  (defun fk/home ()
    "Switch to home (dashboard) buffer."
    (interactive)
    (switch-to-buffer "*dashboard*"))
   #+end_src

** go-messages
   #+begin_src emacs-lisp
  (defun fk/messages ()
    "Switch to Messages buffer."
    (interactive)
    (switch-to-buffer "*Messages*"))
   #+end_src

** org-imenu
   #+begin_src emacs-lisp
     (defun fk/org-imenu ()
       "Go to a heading with helm-imenu and expand the heading."
       (interactive)
       (helm-imenu)
       (show-subtree))
   #+end_src

** darken-background
   #+begin_src emacs-lisp
  ;; I use this to darken non-file buffers like treemacs, helm etc.
  (defun fk/darken-background ()
    "Darken the background of the buffer."
    (interactive)
    (face-remap-add-relative 'default :background (face-attribute 'hl-line :background)))
   #+end_src

** indent-buffer
   #+begin_src emacs-lisp
  (defun fk/indent-buffer ()
    "Indent buffer."
    (interactive)
    (indent-region (point-min) (point-max)))
   #+end_src

